recipes/cashew-ramen-egg.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Cashew Ramen Egg</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="james" />
<link rel="stylesheet" type="text/css" href="../static/recipe.css" />
<link rel="icon" type="image/ico" href="../static/favicon.svg" />
</head>
<body>
<div id="org-div-home-and-up"> <a href="../index.html"> Home </a> </div> <div id="btns"><button id="copy-btn" onclick="copyTicked()"></button> <button id="untick-btn" onclick="untickAll()"></button></div><div id="notify">Copied!</div><div id="content">
<h1 class="title">Cashew Ramen Egg</h1>
<p>
<a href="https://www.youtube.com/watch?v=VG3Mo2oKILI">Original link</a>
</p>

<div id="outline-container-orge8c337d" class="outline-2">
<h2 id="orge8c337d">Ingredients</h2>
<div class="outline-text-2" id="text-orge8c337d">
</div>
<div id="outline-container-orgadcbfc9" class="outline-3">
<h3 id="orgadcbfc9">Egg white</h3>
<div class="outline-text-3" id="text-orgadcbfc9">
<ul class="org-ul">
<li>1 1/2 cups cashew milk</li>
<li>2 tsp agar agar powder</li>
<li>1/2 tsp black salt</li>
</ul>
</div>
</div>

<div id="outline-container-orgd755410" class="outline-3">
<h3 id="orgd755410">Egg yolk</h3>
<div class="outline-text-3" id="text-orgd755410">
<ul class="org-ul">
<li>1/2 cup canned chickpeas</li>
<li>1/4 cup chickpea water</li>
<li>1/4 tsp pink salt</li>
<li>1/2 tbsp turmeric powder</li>
<li>2 tbsp grapeseed oil</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgaa9f302" class="outline-2">
<h2 id="orgaa9f302">Method</h2>
<div class="outline-text-2" id="text-orgaa9f302">
<ol class="org-ol">
<li>Add the egg white ingredients to the blender, and blitz until emulsified</li>
<li>Pour the mixture into a small saucepan, and heat until it just comes to a boil while stirring continuously</li>
<li>Immediately pour the mixture into an egg mould</li>
<li>Place the mould carefully in the fridge for 40min</li>
<li>In a clean blender, add the egg yolk ingredients. Blend on medium high to leave a little bit of texture</li>
<li>Pour the mixture into a small cup, and add the grapeseed oil. Stir to combine</li>
<li>Carefully pop out the egg whites from the moulds. Then, use a melon baller to create a small cavity in the egg white</li>
<li>Fill the cavity with the egg yolk</li>
</ol>
</div>
</div>
</div>
</body>
</html>
